In [5]:
dict1={'experience':[1,2,2,3,4,3,4,5,1,4],'test_score':[8,9,4,5,3,10,6,7,9,8],'interview_score':[4,5,6,7,8,9,1,2,4,8]
       ,'salary':[50000,60000,60000,80000,1000000,55000,100000,70000,60000,45000]}

In [6]:
import pandas as pd
df=pd.DataFrame(dict1)

In [7]:
df

   experience  test_score  interview_score   salary
0           1           8                4    50000
1           2           9                5    60000
2           2           4                6    60000
3           3           5                7    80000
4           4           3                8  1000000
5           3          10                9    55000
6           4           6                1   100000
7           5           7                2    70000
8           1           9                4    60000
9           4           8                8    45000

In [8]:
df.to_csv('test.csv')